RIET/src/Catalogs/СканированныеДокументыДляПередачиВЭлектронномВиде/СканированныеДокументыДляПередачиВЭлектронномВиде.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СканированныеДокументыДляПередачиВЭлектронномВиде</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ВидыПредставляемыхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОснования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредметДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыУчастников</name>
    <attributes>
      <name>РольУчастника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЮрЛицоНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЮрЛицоИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЮрЛицоКПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицоФамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицоИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицоОтчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицоИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯвляетсяЮрЛицом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/InformationRegisters/ФайлыДокументовРеализацииПолномочийНалоговыхОрганов/ФайлыДокументовРеализацииПолномочийНалоговыхОрганов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФайлыДокументовРеализацииПолномочийНалоговыхОрганов</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСодержимого</name>
    <type>
      <types>EnumRef.ТипыСодержимогоФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтраницы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ОписиИсходящихДокументовВНалоговыеОрганы</types>
      <types>CatalogRef.ДокументыРеализацииПолномочийНалоговыхОрганов</types>
      <types>CatalogRef.СканированныеДокументыДляПередачиВЭлектронномВиде</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Enums/ТипыСодержимогоФайлов/ТипыСодержимогоФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСодержимогоФайлов</name>
  <enumValues>
    <name>Текст866</name>
  </enumValues>
  <enumValues>
    <name>Текст1251</name>
  </enumValues>
  <enumValues>
    <name>xml</name>
  </enumValues>
  <enumValues>
    <name>html</name>
  </enumValues>
  <enumValues>
    <name>pdf</name>
  </enumValues>
  <enumValues>
    <name>rtf</name>
  </enumValues>
  <enumValues>
    <name>tiff</name>
  </enumValues>
  <enumValues>
    <name>jpeg</name>
  </enumValues>
  <enumValues>
    <name>ms_word</name>
  </enumValues>
  <enumValues>
    <name>ms_excel</name>
  </enumValues>
  <enumValues>
    <name>odf_text</name>
  </enumValues>
  <enumValues>
    <name>odf_spreadsheet</name>
  </enumValues>
  <enumValues>
    <name>oxml_word</name>
  </enumValues>
  <enumValues>
    <name>oxml_spreadsheet</name>
  </enumValues>
  <enumValues>
    <name>Неизвестный</name>
  </enumValues>
  <enumValues>
    <name>sgn</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/СканированныеДокументыДляПередачиВЭлектронномВиде/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	// инициализируем контекст ЭДО - модуль обработки
	ТекстСообщения = "";
	КонтекстЭДО = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО(ТекстСообщения);
	Если КонтекстЭДО = Неопределено Тогда 
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	КонтекстЭДО.ОбработкаПолученияФормы("Справочник", "СканированныеДокументыДляПередачиВЭлектронномВиде", ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	

КонецПроцедуры

Функция ОпределитьТипФайлаВложения(ОбъектФайл)
	
	нрегРасширениеФайла = нрег(ОбъектФайл.Расширение);
	Если нрегРасширениеФайла = ".tiff" ИЛИ нрегРасширениеФайла = ".tif" Тогда
		Возврат Перечисления.ТипыСодержимогоФайлов.tiff;
	ИначеЕсли нрегРасширениеФайла = ".jpeg" ИЛИ нрегРасширениеФайла = ".jpg" Тогда
		Возврат Перечисления.ТипыСодержимогоФайлов.jpeg;
	Иначе
		Возврат Перечисления.ТипыСодержимогоФайлов.Неизвестный;
	КонецЕсли;
	
КонецФункции

Функция ЗагрузитьИзВнешнегоИсточникаПоСтруктуреРезультатаВыбора(СтруктураРезультата) Экспорт
	
	МассивСсылокДобавленныхФайлов = Новый Массив;
	
	ПолноеИмяФайлаОбмена		= СтруктураРезультата.ПолноеИмяФайлаОбмена;
	РежимВыбораИзКаталога		= СтруктураРезультата.РежимВыбораИзКаталога;
	
	ОрганизацияЗагрузки			= СтруктураРезультата.ОрганизацияСсылка;
	
	ТЗЗагруженныеДокументы 	= ПолучитьИзВременногоХранилища(СтруктураРезультата.АдресТЗЗагруженныеДокументы);
	ТЗУчастникиДокументов 	= ПолучитьИзВременногоХранилища(СтруктураРезультата.АдресТЗУчастникиДокументов);
	ТЗФайлыДокументов 		= ПолучитьИзВременногоХранилища(СтруктураРезультата.АдресТЗФайлыДокументов);
	ТЗРеквизитыУчастников	= ПолучитьИзВременногоХранилища(СтруктураРезультата.АдресТЗРеквизитыУчастников);
	
	СканДокументы = Справочники.СканированныеДокументыДляПередачиВЭлектронномВиде;
	
	Если РежимВыбораИзКаталога Тогда
		
		КаталогОбмена = ПолноеИмяФайлаОбмена; // в этот каталог уже скопированы файлы из каталога обмена на клиенте
		
	Иначе
		
		КонтекстЭДОСервер = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	
		КаталогОбмена = КонтекстЭДОСервер.СоздатьВременныйКаталогСервер();
	
		// Извлекаем все файлы из ZIP файла обмена
		
		Попытка
			
			ФайлОбмена = Новый Файл(ПолноеИмяФайлаОбмена);
			
			ЧтениеЗИП = Новый ЧтениеZipФайла(ПолноеИмяФайлаОбмена);	
			ЧтениеЗИП.ИзвлечьВсе(КаталогОбмена);
			
		Исключение
			
			Сообщить("Не удалось извлечь файлы из файла обмена", СтатусСообщения.Важное);
			
			Возврат Неопределено;
		КонецПопытки;
		
	КонецЕсли;
	
	// Открываем транзакцию
	НачатьТранзакцию();
	
	Для каждого СтрокаТЗЗагруженныеДокументы Из ТЗЗагруженныеДокументы Цикл
		
		НовыйЭлемент = СканДокументы.СоздатьЭлемент();
		НовыйЭлемент.Организация = ОрганизацияЗагрузки;
		НовыйЭлемент.ВидДокумента = СтрокаТЗЗагруженныеДокументы.ВидДокумента;
		НовыйЭлемент.ДатаДокумента = СтрокаТЗЗагруженныеДокументы.Дата;
		НовыйЭлемент.НомерДокумента = СтрокаТЗЗагруженныеДокументы.Номер;
		НовыйЭлемент.СуммаВсего = СтрокаТЗЗагруженныеДокументы.СуммаВсего;
		НовыйЭлемент.СуммаНалога = СтрокаТЗЗагруженныеДокументы.СуммаНалога;
		НовыйЭлемент.НомерОснования = СтрокаТЗЗагруженныеДокументы.НомерОснования;
		НовыйЭлемент.ДатаОснования = СтрокаТЗЗагруженныеДокументы.ДатаОснования;
		НовыйЭлемент.ПредметДокумента = СтрокаТЗЗагруженныеДокументы.Предмет;
		НовыйЭлемент.НачалоПериода = СтрокаТЗЗагруженныеДокументы.НачалоПериода;
		НовыйЭлемент.КонецПериода = СтрокаТЗЗагруженныеДокументы.КонецПериода;
		
		//Заполним ТЧ РеквизитыУчастников
		ПараметрыОтбораТЗУчастников = Новый Структура;
		ПараметрыОтбораТЗУчастников.Вставить("ИдентификаторДокумента", СтрокаТЗЗагруженныеДокументы.ИдентификаторДокумента);
		
		МассивУчастниковДокумента = ТЗУчастникиДокументов.НайтиСтроки(ПараметрыОтбораТЗУчастников); //массив строк ТЗ УчастникиДокументов
		Для каждого Участник Из МассивУчастниковДокумента Цикл
			НоваяСтрокаУчастник = НовыйЭлемент.РеквизитыУчастников.Добавить();	
			НоваяСтрокаУчастник.РольУчастника = Участник.Роль;
			
			//для остальных реквизитов найдем нужную строку в ТЗРеквизитыУчастников
			СтрокаРеквизитов = ТЗРеквизитыУчастников.Найти(Участник.ИдентификаторУчастника, "ИдентификаторУчастника");
			Если СтрокаРеквизитов = Неопределено Тогда
				Сообщить("Не удалось определить реквизиты одного из участников документа:
				|" + СтрокаТЗЗагруженныеДокументы.ПредставлениеДокумента, СтатусСообщения.Важное);
				
				ОтменитьТранзакцию();
				Возврат Неопределено;
			КонецЕсли;
			
			НоваяСтрокаУчастник.ЯвляетсяЮрЛицом = СтрокаРеквизитов.ЯвляетсяЮрЛицом;
			
			Если СтрокаРеквизитов.ЯвляетсяЮрЛицом Тогда
				НоваяСтрокаУчастник.ЮрЛицоНаименование = СтрокаРеквизитов.НаименованиеОрганизации;
				НоваяСтрокаУчастник.ЮрЛицоИНН = СтрокаРеквизитов.ИНН;
				НоваяСтрокаУчастник.ЮрЛицоКПП = СтрокаРеквизитов.КПП;
				
			Иначе
				
				НоваяСтрокаУчастник.ФизЛицоИНН 		= СтрокаРеквизитов.ИНН;
				НоваяСтрокаУчастник.ФизЛицоФамилия 	= СтрокаРеквизитов.ФамилияИП;
				НоваяСтрокаУчастник.ФизЛицоИмя 		= СтрокаРеквизитов.ИмяИП;
				НоваяСтрокаУчастник.ФизЛицоОтчество = СтрокаРеквизитов.ОтчествоИП;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Попытка
			НовыйЭлемент.Записать();
		Исключение
			Сообщить("Не удалось записать элемент справочника:
			|" + ОписаниеОшибки(), СтатусСообщения.Важное);
			
			ОтменитьТранзакцию();
			Возврат Неопределено;
		КонецПопытки;
		
		ОбъектСсылка = НовыйЭлемент.Ссылка;
		
		МассивСсылокДобавленныхФайлов.Добавить(ОбъектСсылка);
		
		//Загрузим файлы документа
		ПараметрыОтбораТЗФайлыДокументов = Новый Структура;
		ПараметрыОтбораТЗФайлыДокументов.Вставить("ИдентификаторДокумента", СтрокаТЗЗагруженныеДокументы.ИдентификаторДокумента);
		
		МассивФайловДокумента = ТЗФайлыДокументов.НайтиСтроки(ПараметрыОтбораТЗФайлыДокументов); //массив строк ТЗФайлыДокументов
		
		// Наполняем регистр сведений ФайлыДокументовРеализацииПолномочийНалоговыхОрганов файлами
		НаборЗаписей = РегистрыСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Документ.Установить(ОбъектСсылка); 
		НаборЗаписей.Прочитать();
		
		Для каждого СтрокаТЗФайлыДокументов Из МассивФайловДокумента Цикл
			
			ИмяЗагружаемогоФайла = СтрокаТЗФайлыДокументов.ИмяНаДиске;
			
			ПолноеИмяЗагружаемогоФайла = КаталогОбмена + ИмяЗагружаемогоФайла;
			ЗагружаемыйФайл = Новый Файл(ПолноеИмяЗагружаемогоФайла);
			
			Если НЕ ЗагружаемыйФайл.Существует() Тогда
				Сообщить("В пакете обмена не обнаружен файл
				|" + ИмяЗагружаемогоФайла, СтатусСообщения.Важное);
				
				ОтменитьТранзакцию();
				Возврат Неопределено;
			КонецЕсли;
			
			РазмерФайла = ЗагружаемыйФайл.Размер();
			
			НоваяЗапись = НаборЗаписей.Добавить();
			
			НоваяЗапись.Документ = ОбъектСсылка;
			НоваяЗапись.ИмяФайла = СтрокаТЗФайлыДокументов.Имя;
			НоваяЗапись.НомерСтраницы = СтрокаТЗФайлыДокументов.НомерСтраницы;
			НоваяЗапись.ТипСодержимого = ОпределитьТипФайлаВложения(ЗагружаемыйФайл);
			НоваяЗапись.Размер = РазмерФайла;
			НоваяЗапись.Данные = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ПолноеИмяЗагружаемогоФайла), Новый СжатиеДанных(9));;
			
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	// Завершаем транзакцию
	ЗафиксироватьТранзакцию();
	
	//Удаляем файлы временного каталога
	Попытка
		
		УдалитьФайлы(КаталогОбмена);
		
		Если НЕ РежимВыбораИзКаталога Тогда
			УдалитьФайлы(ПолноеИмяФайлаОбмена);
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
	Возврат МассивСсылокДобавленныхФайлов;

КонецФункции

#КонецЕсли
